using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace InariPoker
{
    public static class Roars
    {
        static string[] roars = new string[] {
            "ああここか・・・ええやん！",
            "ああ～～いいっすね～",
            "ああ～～たまらねぇぜ",
            "あのさぁ……",
            "あほくさ",
            "ありがとナス！",
            "あーあもう滅茶苦茶だよ",
            "いいゾ～これ",
            "いなりが入ってないやん",
            "うわー",
            "うん、美味しい！",
            "ええやん（満足）",
            "おっ、そうだな",
            "おっ大丈夫か",
            "おとなしくしろ！ばらまくぞこの野郎！",
            "お前のことが好きだったんだよ！",
            "かしこまり！",
            "こ↑こ↓",
            "これもうわかんねぇな",
            "すいません許してください！何でもしますから！",
            "そうだよ(便乗)",
            "そんなことしなくていいから(良心)",
            "ちょっとおとなしくしててくれる？",
            "どうかしましたか？",
            "どうしてくれんのこれ？",
            "なんやその態度？",
            "ぬわああああん疲れたもおおおおん",
            "はい！",
            "はぇ～",
            "はっきりわかんだね",
            "ふーん……",
            "ほんとぉ？",
            "まぁ多少はね？",
            "やったぜ",
            "やめてくれよ…(絶望)",
            "ん？今なんでもするって言ったよね？",
            "オッスお願いしまーす！",
            "オナシャス！",
            "ダメみたいですね……",
            "ヌッ！",
            "ファッ！？",
            "ホンマ使えん",
            "ボッタクリやろこれ！",
            "入って、どうぞ",
            "冗談はよしてくれ",
            "当たり前だよなぁ？",
            "悔い改めて",
            "見たけりゃ見せてやるよ(震え声)",
            "見とけよ見とけよ～",
            "ｳﾜｧｧｧｧｧｧ…",
            "ﾏｧｧｧｧｧｧ…"
        };

        public static string GetText(int num)
        {
            return roars[num];
        }

        public static int GetMaxNum()
        {
            return roars.Length;
        }
    }
}
